import Home from "../pages/_app";

export const LETTERS: Array<string> = [
  'А', 'Б', 'В', 'Г', 'Ґ', 'Д', 'Е', 'Є', 'Ж', 'З', 'И', 'І', 'Ї', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ю', 'Я',
  'а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ю', 'я',
  '\'',
]

export const REGIONS: Array<string> = [
  'Київська область', 'Вінницька область', 'Волинська область', 'Дніпропетровська область','Донецька область','Житомирська область',
  'Закарпатська область','Запорізька область','Івано-Франківська область','Кіровоградська область', 'АР Крим', 'Луганська область',
  'Львівська область', 'Миколаївська область','Одеська область','Полтавська область', 'Рівненська область', 'Сумська область','Тернопільська область',
  'Харківська область', 'Херсонська область', 'Хмельницька область','Черкаська область', 'Чернівецька область','Чернігівська область'
]

export function saveValue(name: string, value: any) {
  Home.dataObject[name] = value;
  console.log(Home.dataObject);
}